keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC0_BLK26_RABR.
* To use register names with standard convension, please use OVC0_BLK26_RABR.
*/
#define	OVC0_RABR26	(OVC0_BLK26_RABR)

/** \\brief  15C, Overlay Mask Register */
#define OVC0_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC5Cu)

/** Alias (User Manual Name) for OVC0_BLK27_OMASK.
* To use register names with standard convension, please use OVC0_BLK27_OMASK.
*/
#define	OVC0_OMASK27	(OVC0_BLK27_OMASK)

/** \\brief  158, Overlay Target Address Register */
#define OVC0_BLK27_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC58u)

/** Alias (User Manual Name) for OVC0_BLK27_OTAR.
* To use register names with standard convension, please use OVC0_BLK27_OTAR.
*/
#define	OVC0_OTAR27	(OVC0_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC0_BLK27_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC54u)

/** Alias (User Manual Name) for OVC0_BLK27_RABR.
* To use register names with standard convension, please use OVC0_BLK27_RABR.
*/
#define	OVC0_RABR27	(OVC0_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC0_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC68u)

/** Alias (User Manual Name) for OVC0_BLK28_OMASK.
* To use register names with standard convension, please use OVC0_BLK28_OMASK.
*/
#define	OVC0_OMASK28	(OVC0_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC0_BLK28_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC64u)

/** Alias (User Manual Name) for OVC0_BLK28_OTAR.
* To use register names with standard convension, please use OVC0_BLK28_OTAR.
*/
#define	OVC0_OTAR28	(OVC0_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC0_BLK28_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC60u)

/** Alias (User Manual Name) for OVC0_BLK28_RABR.
* To use register names with standard convension, please use OVC0_BLK28_RABR.
*/
#define	OVC0_RABR28	(OVC0_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC0_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC74u)

/** Alias (User Manual Name) for OVC0_BLK29_OMASK.
* To use register names with standard convension, please use OVC0_BLK29_OMASK.
*/
#define	OVC0_OMASK29	(OVC0_BLK29_OMASK)

/** \\brief  170, Overlay Target Address Register */
#define OVC0_BLK29_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC70u)

/** Alias (User Manual Name) for OVC0_BLK29_OTAR.
* To use register names with standard convension, please use OVC0_BLK29_OTAR.
*/
#define	OVC0_OTAR29	(OVC0_BLK29_OTAR)

/** \\brief  16C, Redirected Address Base Register */
#define OVC0_BLK29_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC6Cu)

/** Alias (User Manual Name) for OVC0_BLK29_RABR.
* To use register names with standard convension, please use OVC0_BLK29_RABR.
*/
#define	OVC0_RABR29	(OVC0_BLK29_RABR)

/** \\brief  30, Overlay Mask Register */
#define OVC0_BLK2_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB30u)

/** Alias (User Manual Name) for OVC0_BLK2_OMASK.
* To use register names with standard convension, please use OVC0_BLK2_OMASK.
*/
#define	OVC0_OMASK2	(OVC0_BLK2_OMASK)

/** \\brief  2C, Overlay Target Address Register */
#define OVC0_BLK2_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FB2Cu)

/** Alias (User Manual Name) for OVC0_BLK2_OTAR.
* To use register names with standard convension, please use OVC0_BLK2_OTAR.
*/
#define	OVC0_OTAR2	(OVC0_BLK2_OTAR)

/** \\brief  28, Redirected Address Base Register */
#define OVC0_BLK2_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FB28u)

/** Alias (User Manual Name) for OVC0_BLK2_RABR.
* To use register names with standard convension, please use OVC0_BLK2_RABR.
*/
#define	OVC0_RABR2	(OVC0_BLK2_RABR)

/** \\brief  180, Overlay Mask Register */
#define OVC0_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC80u)

/** Alias (User Manual Name) for OVC0_BLK30_OMASK.
* To use register names with standard convension, please use OVC0_BLK30_OMASK.
*/
#define	OVC0_OMASK30	(OVC0_BLK30_OMASK)

/** \\brief  17C, Overlay Target Address Register */
#define OVC0_BLK30_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC7Cu)

/** Alias (User Manual Name) for OVC0_BLK30_OTAR.
* To use register names with standard convension, please use OVC0_BLK30_OTAR.
*/
#define	OVC0_OTAR30	(OVC0_BLK30_OTAR)

/** \\brief  178, Redirected Address Base Register */
#define OVC0_BLK30_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC78u)

/** Alias (User Manual Name) for OVC0_BLK30_RABR.
* To use register names with standard convension, please use OVC0_BLK30_RABR.
*/
#define	OVC0_RABR30	(OVC0_BLK30_RABR)

/** \\brief  18C, Overlay Mask Register */
#define OVC0_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FC8Cu)

/** Alias (User Manual Name) for OVC0_BLK31_OMASK.
* To use register names with standard convension, please use OVC0_BLK31_OMASK.
*/
#define	OVC0_OMASK31	(OVC0_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC0_BLK31_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF880FC88u)

/** Alias (User Manual Name) for OVC0_BLK31_OTAR.
* To use register names with standard convension, please use OVC0_BLK31_OTAR.
*/
#define	OVC0_OTAR31	(OVC0_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC0_BLK31_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF880FC84u)

/** Alias (User Manual Name) for OVC0_BLK31_RABR.
* To use register names with standard convension, please use OVC0_BLK31_RABR.
*/
#define	OVC0_RABR31	(OVC0_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC0_BLK3_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF880FB3Cu)

/** Alias (User Manual Name) for OVC0_BLK3_OMASK.
* To use register names with standard convension, please use OVC0_BLK3_OMASK.
*/
#define	OVC0_OMASK3	(OVC0_BLK3_OMASK)

