keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxOvc_reg.h
/** \\brief  158, Overlay Target Address Register */
#define OVC1_BLK27_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC58u)

/** Alias (User Manual Name) for OVC1_BLK27_OTAR.
* To use register names with standard convension, please use OVC1_BLK27_OTAR.
*/
#define	OVC1_OTAR27	(OVC1_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC1_BLK27_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC54u)

/** Alias (User Manual Name) for OVC1_BLK27_RABR.
* To use register names with standard convension, please use OVC1_BLK27_RABR.
*/
#define	OVC1_RABR27	(OVC1_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC1_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC68u)

/** Alias (User Manual Name) for OVC1_BLK28_OMASK.
* To use register names with standard convension, please use OVC1_BLK28_OMASK.
*/
#define	OVC1_OMASK28	(OVC1_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC1_BLK28_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC64u)

/** Alias (User Manual Name) for OVC1_BLK28_OTAR.
* To use register names with standard convension, please use OVC1_BLK28_OTAR.
*/
#define	OVC1_OTAR28	(OVC1_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC1_BLK28_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC60u)

/** Alias (User Manual Name) for OVC1_BLK28_RABR.
* To use register names with standard convension, please use OVC1_BLK28_RABR.
*/
#define	OVC1_RABR28	(OVC1_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC1_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC74u)

/** Alias (User Manual Name) for OVC1_BLK29_OMASK.
* To use register names with standard convension, please use OVC1_BLK29_OMASK.
*/
#define	OVC1_OMASK29	(OVC1_BLK29_OMASK)

/** \\brief  170, Overlay Target Address Register */
#define OVC1_BLK29_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC70u)

/** Alias (User Manual Name) for OVC1_BLK29_OTAR.
* To use register names with standard convension, please use OVC1_BLK29_OTAR.
*/
#define	OVC1_OTAR29	(OVC1_BLK29_OTAR)

/** \\brief  16C, Redirected Address Base Register */
#define OVC1_BLK29_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC6Cu)

/** Alias (User Manual Name) for OVC1_BLK29_RABR.
* To use register names with standard convension, please use OVC1_BLK29_RABR.
*/
#define	OVC1_RABR29	(OVC1_BLK29_RABR)

/** \\brief  30, Overlay Mask Register */
#define OVC1_BLK2_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB30u)

/** Alias (User Manual Name) for OVC1_BLK2_OMASK.
* To use register names with standard convension, please use OVC1_BLK2_OMASK.
*/
#define	OVC1_OMASK2	(OVC1_BLK2_OMASK)

/** \\brief  2C, Overlay Target Address Register */
#define OVC1_BLK2_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB2Cu)

/** Alias (User Manual Name) for OVC1_BLK2_OTAR.
* To use register names with standard convension, please use OVC1_BLK2_OTAR.
*/
#define	OVC1_OTAR2	(OVC1_BLK2_OTAR)

/** \\brief  28, Redirected Address Base Register */
#define OVC1_BLK2_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB28u)

/** Alias (User Manual Name) for OVC1_BLK2_RABR.
* To use register names with standard convension, please use OVC1_BLK2_RABR.
*/
#define	OVC1_RABR2	(OVC1_BLK2_RABR)

/** \\brief  180, Overlay Mask Register */
#define OVC1_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC80u)

/** Alias (User Manual Name) for OVC1_BLK30_OMASK.
* To use register names with standard convension, please use OVC1_BLK30_OMASK.
*/
#define	OVC1_OMASK30	(OVC1_BLK30_OMASK)

/** \\brief  17C, Overlay Target Address Register */
#define OVC1_BLK30_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC7Cu)

/** Alias (User Manual Name) for OVC1_BLK30_OTAR.
* To use register names with standard convension, please use OVC1_BLK30_OTAR.
*/
#define	OVC1_OTAR30	(OVC1_BLK30_OTAR)

/** \\brief  178, Redirected Address Base Register */
#define OVC1_BLK30_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC78u)

/** Alias (User Manual Name) for OVC1_BLK30_RABR.
* To use register names with standard convension, please use OVC1_BLK30_RABR.
*/
#define	OVC1_RABR30	(OVC1_BLK30_RABR)

/** \\brief  18C, Overlay Mask Register */
#define OVC1_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FC8Cu)

/** Alias (User Manual Name) for OVC1_BLK31_OMASK.
* To use register names with standard convension, please use OVC1_BLK31_OMASK.
*/
#define	OVC1_OMASK31	(OVC1_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC1_BLK31_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FC88u)

/** Alias (User Manual Name) for OVC1_BLK31_OTAR.
* To use register names with standard convension, please use OVC1_BLK31_OTAR.
*/
#define	OVC1_OTAR31	(OVC1_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC1_BLK31_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FC84u)

/** Alias (User Manual Name) for OVC1_BLK31_RABR.
* To use register names with standard convension, please use OVC1_BLK31_RABR.
*/
#define	OVC1_RABR31	(OVC1_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC1_BLK3_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB3Cu)

/** Alias (User Manual Name) for OVC1_BLK3_OMASK.
* To use register names with standard convension, please use OVC1_BLK3_OMASK.
*/
#define	OVC1_OMASK3	(OVC1_BLK3_OMASK)

/** \\brief  38, Overlay Target Address Register */
#define OVC1_BLK3_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB38u)

/** Alias (User Manual Name) for OVC1_BLK3_OTAR.
* To use register names with standard convension, please use OVC1_BLK3_OTAR.
*/
#define	OVC1_OTAR3	(OVC1_BLK3_OTAR)

/** \\brief  34, Redirected Address Base Register */
#define OVC1_BLK3_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB34u)

/** Alias (User Manual Name) for OVC1_BLK3_RABR.
* To use register names with standard convension, please use OVC1_BLK3_RABR.
*/
#define	OVC1_RABR3	(OVC1_BLK3_RABR)

/** \\brief  48, Overlay Mask Register */
#define OVC1_BLK4_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB48u)

/** Alias (User Manual Name) for OVC1_BLK4_OMASK.
* To use register names with standard convension, please use OVC1_BLK4_OMASK.
*/
#define	OVC1_OMASK4	(OVC1_BLK4_OMASK)

/** \\brief  44, Overlay Target Address Register */
#define OVC1_BLK4_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB44u)

/** Alias (User Manual Name) for OVC1_BLK4_OTAR.
* To use register names with standard convension, please use OVC1_BLK4_OTAR.
*/
#define	OVC1_OTAR4	(OVC1_BLK4_OTAR)

/** \\brief  40, Redirected Address Base Register */
#define OVC1_BLK4_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB40u)

/** Alias (User Manual Name) for OVC1_BLK4_RABR.
* To use register names with standard convension, please use OVC1_BLK4_RABR.
*/
#define	OVC1_RABR4	(OVC1_BLK4_RABR)

/** \\brief  54, Overlay Mask Register */
#define OVC1_BLK5_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB54u)

/** Alias (User Manual Name) for OVC1_BLK5_OMASK.
* To use register names with standard convension, please use OVC1_BLK5_OMASK.
*/
#define	OVC1_OMASK5	(OVC1_BLK5_OMASK)

