keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxOvc_reg.h
/** \\brief  50, Overlay Target Address Register */
#define OVC1_BLK5_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB50u)

/** Alias (User Manual Name) for OVC1_BLK5_OTAR.
* To use register names with standard convension, please use OVC1_BLK5_OTAR.
*/
#define	OVC1_OTAR5	(OVC1_BLK5_OTAR)

/** \\brief  4C, Redirected Address Base Register */
#define OVC1_BLK5_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB4Cu)

/** Alias (User Manual Name) for OVC1_BLK5_RABR.
* To use register names with standard convension, please use OVC1_BLK5_RABR.
*/
#define	OVC1_RABR5	(OVC1_BLK5_RABR)

/** \\brief  60, Overlay Mask Register */
#define OVC1_BLK6_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB60u)

/** Alias (User Manual Name) for OVC1_BLK6_OMASK.
* To use register names with standard convension, please use OVC1_BLK6_OMASK.
*/
#define	OVC1_OMASK6	(OVC1_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC1_BLK6_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB5Cu)

/** Alias (User Manual Name) for OVC1_BLK6_OTAR.
* To use register names with standard convension, please use OVC1_BLK6_OTAR.
*/
#define	OVC1_OTAR6	(OVC1_BLK6_OTAR)

/** \\brief  58, Redirected Address Base Register */
#define OVC1_BLK6_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB58u)

/** Alias (User Manual Name) for OVC1_BLK6_RABR.
* To use register names with standard convension, please use OVC1_BLK6_RABR.
*/
#define	OVC1_RABR6	(OVC1_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC1_BLK7_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB6Cu)

/** Alias (User Manual Name) for OVC1_BLK7_OMASK.
* To use register names with standard convension, please use OVC1_BLK7_OMASK.
*/
#define	OVC1_OMASK7	(OVC1_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC1_BLK7_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB68u)

/** Alias (User Manual Name) for OVC1_BLK7_OTAR.
* To use register names with standard convension, please use OVC1_BLK7_OTAR.
*/
#define	OVC1_OTAR7	(OVC1_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC1_BLK7_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB64u)

/** Alias (User Manual Name) for OVC1_BLK7_RABR.
* To use register names with standard convension, please use OVC1_BLK7_RABR.
*/
#define	OVC1_RABR7	(OVC1_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC1_BLK8_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB78u)

/** Alias (User Manual Name) for OVC1_BLK8_OMASK.
* To use register names with standard convension, please use OVC1_BLK8_OMASK.
*/
#define	OVC1_OMASK8	(OVC1_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC1_BLK8_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB74u)

/** Alias (User Manual Name) for OVC1_BLK8_OTAR.
* To use register names with standard convension, please use OVC1_BLK8_OTAR.
*/
#define	OVC1_OTAR8	(OVC1_BLK8_OTAR)

/** \\brief  70, Redirected Address Base Register */
#define OVC1_BLK8_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB70u)

/** Alias (User Manual Name) for OVC1_BLK8_RABR.
* To use register names with standard convension, please use OVC1_BLK8_RABR.
*/
#define	OVC1_RABR8	(OVC1_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC1_BLK9_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF882FB84u)

/** Alias (User Manual Name) for OVC1_BLK9_OMASK.
* To use register names with standard convension, please use OVC1_BLK9_OMASK.
*/
#define	OVC1_OMASK9	(OVC1_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC1_BLK9_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF882FB80u)

/** Alias (User Manual Name) for OVC1_BLK9_OTAR.
* To use register names with standard convension, please use OVC1_BLK9_OTAR.
*/
#define	OVC1_OTAR9	(OVC1_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC1_BLK9_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF882FB7Cu)

/** Alias (User Manual Name) for OVC1_BLK9_RABR.
* To use register names with standard convension, please use OVC1_BLK9_RABR.
*/
#define	OVC1_RABR9	(OVC1_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC1_OSEL /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL*)0xF882FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc2
 * \{  */

/** \\brief  18, Overlay Mask Register */
#define OVC2_BLK0_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB18u)

/** Alias (User Manual Name) for OVC2_BLK0_OMASK.
* To use register names with standard convension, please use OVC2_BLK0_OMASK.
*/
#define	OVC2_OMASK0	(OVC2_BLK0_OMASK)

/** \\brief  14, Overlay Target Address Register */
#define OVC2_BLK0_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB14u)

/** Alias (User Manual Name) for OVC2_BLK0_OTAR.
* To use register names with standard convension, please use OVC2_BLK0_OTAR.
*/
#define	OVC2_OTAR0	(OVC2_BLK0_OTAR)

/** \\brief  10, Redirected Address Base Register */
#define OVC2_BLK0_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB10u)

/** Alias (User Manual Name) for OVC2_BLK0_RABR.
* To use register names with standard convension, please use OVC2_BLK0_RABR.
*/
#define	OVC2_RABR0	(OVC2_BLK0_RABR)

/** \\brief  90, Overlay Mask Register */
#define OVC2_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB90u)

/** Alias (User Manual Name) for OVC2_BLK10_OMASK.
* To use register names with standard convension, please use OVC2_BLK10_OMASK.
*/
#define	OVC2_OMASK10	(OVC2_BLK10_OMASK)

/** \\brief  8C, Overlay Target Address Register */
#define OVC2_BLK10_OTAR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR*)0xF884FB8Cu)

/** Alias (User Manual Name) for OVC2_BLK10_OTAR.
* To use register names with standard convension, please use OVC2_BLK10_OTAR.
*/
#define	OVC2_OTAR10	(OVC2_BLK10_OTAR)

/** \\brief  88, Redirected Address Base Register */
#define OVC2_BLK10_RABR /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR*)0xF884FB88u)

/** Alias (User Manual Name) for OVC2_BLK10_RABR.
* To use register names with standard convension, please use OVC2_BLK10_RABR.
*/
#define	OVC2_RABR10	(OVC2_BLK10_RABR)

/** \\brief  9C, Overlay Mask Register */
#define OVC2_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK*)0xF884FB9Cu)

